app/Controllers/Contact.php

SELECT *
FROM `messages`
ORDER BY `created_at` DESC
---
   public function index()
{
    $messageModel = new MessageModel();
    $data = [
        'messages' => $messageModel->orderBy('created_at', 'DESC')->findAll(),
        'pager' => $messageModel->pager,
        'passLink' => "inbox",
    ];