app/Controllers/DashboardController.php

    public function index()
    {
        // Initialize models
        $projectModel = new ProjectModel();
        $teamModel = new TeamModel();
        $messageModel = new MessageModel();

        // Get counts for stats cards
        $data['incompletedProjects'] = $projectModel->where('status !=', 'published')->countAllResults();
        $data['teamMembers'] = $teamModel->where('is_active', 1)->countAllResults();
        $data['messageCount'] = $messageModel->countAllResults();
        $data['completedProjects'] = $projectModel->where('status', 'published')->countAllResults();

        // Get recent activity
        $data['recentProjects'] = $projectModel
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();

        $data['recentMessages'] = $messageModel
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` != 'published'
AND `projects`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `team`
WHERE `is_active` = 1
AND `team`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `messages`
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'published'
AND `projects`.`deleted_at` IS NULL
SELECT *
FROM `projects`
WHERE `projects`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
SELECT *
FROM `messages`
ORDER BY `created_at` DESC