app/Controllers/PortfolioController.php

    public function manage()
    {
        $data = [
            'title' => 'Manage Portfolio',
            'userData' => session()->get('userData'),
            'passLink' => 'portfolio',
            'projects' => $this->projectModel->where('deleted_at', null)
                             ->orderBy('project_date', 'DESC')
                             ->paginate(10),
---
SELECT *
FROM `projects`
WHERE `deleted_at` IS NULL
AND `projects`.`deleted_at` IS NULL
ORDER BY `project_date` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `deleted_at` IS NULL
AND `projects`.`deleted_at` IS NULL

    public function edit($projectId)
    {
        $project = $this->projectModel->find($projectId);
---
SELECT *
FROM `projects`
WHERE `projects`.`deleted_at` IS NULL
AND `projects`.`projectId` = '7'