app/Controllers/TeamMemberController.php

    public function index()
    {
        $data['passLink'] = "team";
        $data['userData'] = session()->get('userData');

        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;

        $data['all_team'] = $this->teamModel->where('deleted_at', null)->paginate($perPage);
---
SELECT *
FROM `team`
WHERE `deleted_at` IS NULL
AND `team`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `team`
WHERE `deleted_at` IS NULL
AND `team`.`deleted_at` IS NULL